// ვიპოვოთ [г или т], და შემდეგ "оп"
console.log( "Гоп-стоп".match(/[гт]оп/gi) ); // "Гоп", "топ" ნაკრები

// მოძებნის "xAF" - ს
console.log( "Exception 0xFa 0xAF".match(/x[0-9A-F][0-9A-F]/g) );  //

// [a-z] – სიმბოლოები a-დან z-ის ჩათვლით, [0-5] – ციფრები 0-დან 5-ის ჩათვლით. მოვძებნოთ დამთხვევა სადაც სიმბოლო "x"-ის შემდეგ მოდის ორჯერ ზედიზედ ან ნებისმიერი ციფრი ან ასოები A-დან F-მდე:
//პირველ X რატომ არ აჩვენებს ვერ მივხვდი??  i!!სთნ ერთად აჩვენებს დანარჩენებსაც
//[ 'xce', 'xFa', 'xAF' ]
//[0-9A-F] ეს რამდენჯერაცაა იმდენ სიმბოლოს ეძებს. 

//[^აქ რასაც ჩაწერ, ამათ გარდა დანარჩენი გამოჩნდება ]
console.log( "alice15@gmail.com".match(/[^\d\sA-Z]/gi) ); // "@", "."  digits and letters from a to z