console.log( +" -12" ); // -12
console.log( +" \n34 \n" ); // 34, ხაზის გადატანა \n ითვლება ცარიელ სიმბოლოდ
console.log( +"" ); // 0, ცარიელი სტრიქონი გარდაიქმნება 0-ად
console.log( +"1 2" ); // NaN, ცარიელი სიმბოლო რიცხვის შიგნით - შეცდომა

//parseInt() - ტექსტის გარდაქმნა მთელ რიცხვად
// parseFloat() - ტექსტის გარდაქმნა მცოცავმძიმიან რიცხვად

console.log( parseInt('12px') ); // 12

console.log( parseInt('12px') ) // 12, შეცდომა სიმბოლო 'p' - ზე 
console.log( parseFloat('12.3.4') ) // 12.3, შეცდომა მეორე წერტილზე

// თუ parseInt() და parseFloat() ფუნქციების არგუმენტები არ იწყება რიცხვით მაშინ ისინი აბრუნებენ მნიშვნელობას NaN, რადგან რიცხვის ძებნა იწყება არგუმენტის დასაწყისიდანვე დანარჩენი ნაწილი კი უგულებელყოფილია.
console.log(parseInt("12 საათია")); // 12
console.log(parseInt("ახლა არის 12 საათი")) // NaN
console.log(parseFloat("0.5 ლიტრი ლუდი")) // 0.5
console.log(parseFloat("მომეცით 0.5 ლიტრი ლუდი")) // NaN